argen1234-code/ti_mspm0g3507/mspm0_sdk_2_02_00_05/examples/nortos/LP_MSPM0G3507/driverlib/empty/main.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G3507 --rtos freertos

/**
 * Import the modules used in this configuration.
 */
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");
const SYSCTL         = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * ======== Board / SYSCTL ========
 */
const Board                       = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.peripheral.$assign          = "DEBUGSS";
Board.peripheral.swclkPin.$assign = "PA20";
Board.peripheral.swdioPin.$assign = "PA19";

ProjectConfig.genDisable = true;

SYSCTL.forceDefaultClkConfig = true;
